# BendWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfileWithLips..::..BendWidth Property
StructuralSectionSigmaProfileWithLips Class See Also
---
Bend segment width.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double BendWidth { get; set; }
```

Visual Basic
---
```text
Public Property BendWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BendWidth {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionSigmaProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace